{"you": {"rank": 0, "defs": [{"etymology": "From Middle English you, yow, ȝow (object case of ye), from Old English ēow, īow (“you”, dative case of ġē), from Proto-Germanic *iwwiz (“you”, dative case of *jīz), Western form of *izwiz (“you”, dative case of *jūz), from Proto-Indo-European *yūs (“you”, plural), *yū́.\nCognate with Scots you (“you”), Saterland Frisian jou (“you”), West Frisian jo (“you”), Low German jo, joe and oe (“you”), Dutch jou and u (“you”), Middle High German eu, iu (“you”, object pronoun), Latin vōs (“you”), Avestan 𐬬𐬋‎ (vō, “you”), Ashkun iã (“you”), Kamkata-viri šo (“you”), Sanskrit यूयम् (yūyám, “you”)See usage notes. Ye, you and your are cognate with Dutch jij/je, jou, jouw; Low German ji, jo/ju, jug and German ihr, euch and euer respectively. Ye is also cognate with archaic Swedish I.\n", "definitions": [{"partOfSpeech": "pronoun", "text": ["you (second person, singular or plural, nominative or objective, possessive determiner your, possessive pronoun yours, singular reflexive yourself, plural reflexive yourselves)", "(object pronoun) The people spoken, or written to, as an object. [from 9th c.]", "(reflexive, now US colloquial) (To) yourselves, (to) yourself. [from 9th c.]", "(object pronoun) The person spoken to or written to, as an object. (Replacing thee; originally as a mark of respect.) [from 13th c.]", "(subject pronoun) The people spoken to or written to, as a subject. (Replacing ye.) [from 14th c.]", "(subject pronoun) The person spoken to or written to, as a subject. (Originally as a mark of respect.) [from 15th c.]", "(indefinite personal pronoun) Anyone, one; an unspecified individual or group of individuals (as subject or object). [from 16th c.]"], "relatedWords": [{"relationshipType": "synonyms", "words": ["(subject pronoun: person spoken/written to):yer (UK eye dialect)plus the alternative forms listed above and at Appendix:English personal pronouns", "(subject pronoun: persons spoken/written to; plural): See Thesaurus:y'all", "(object pronoun: person spoken/written to): thee (singular, archaic), ye, to you, to thee, to ye", "(object pronoun: persons spoken/written to): ye, to you, to ye, to you all", "(one): one, people, they, them"]}], "examples": ["Both of you should get ready now.", "And Ioſeph ſaid vnto them, That is it that I ſpake vnto you, ſaying, Ye are ſpies.", "If I may counsaile you, some day or two / Your Highnesse shall repose you at the Tower [...].", "And Lot went out, and spake unto his sons in law, which married his daughters, and said, Up, get you out of this place; for the Lord will destroy this city.", "'Draw near, and wash you in the living flames, and take their virtue into your poor frames in all its virgin strength[.]'", "‘Pull you up a chair,’ she offered.", "You'd better get you a gun and kill him before he kills you or somebody.", "I charge you, as ye woll have my love, that ye warne your kynnesmen that ye woll beare that day the slyve of golde uppon your helmet.", "You are all supposed to do as I tell you.", "Are you excited?  ―  Yes, I am excited!\nAudio ", "Audio ", "certes lord / so wel vs liketh yow / And al youre werk / and euere han doon / þat we / Ne koude nat vs self deuysen how / We myghte lyuen / in moore felicitee [...].", "You are right, Fanny, to protest against such an office, but you need not be afraid.", "You can't choose your family, your lovers are difficult and volatile, but, oh, you can choose your friends - so doesn't it make much more sense to live and holiday with them instead?"]}, {"partOfSpeech": "determiner", "text": ["you", "The individual or group spoken or written to.", "Used before epithets, describing the person being addressed, for emphasis."], "relatedWords": [], "examples": ["Have you gentlemen come to see the lady who fell backwards off a bus?", "You idiot!", "'You genius!' I shouted in Aretta's ear. 'You absolute genius! Why didn't you tell us you were so good?'"]}, {"partOfSpeech": "verb", "text": ["you (third-person singular simple present yous, present participle youing, simple past and past participle youed)", "(transitive) To address (a person) using the pronoun you (in the past, especially to use you rather than thou, when you was considered more formal)."], "relatedWords": [], "examples": ["Youing consists in relating everything in the conversation to the person you wish to flatter, and introducing the word “you” into your speech as often as possible.", "Now even Princess Anne had dropped it. Sarah had heard her youing away on television the other night just like the inhabitants of her mother’s dominions beyond the seas.", "But even having my very own personal pronoun was risky, because it’s pretty tough to keep stopped-hope stopped up when you are getting all youed up, when someone you really like keeps promising you scary, fun, exciting stuff—and even tougher for the of that moment to remain securely devoid of hope, to make smart, self-denying decisions with Dad youing me—the long ooo of it broad and extended, like a hand."]}], "pronunciations": {"text": ["(stressed)", "(unstressed)"], "audio": [], "rhymes": ["-uː"], "homophones": ["ewe", "u", "yew", "yu", "hew (in h-dropping dialects)", "hue (in h-dropping dialects)"], "ipa": []}}]}}